In [103]:
import pandas as pd

In [104]:
pymoli_file = "./Resources/purchase_data.csv"
pymoli_file_df = pd.read_csv(pymoli_file, encoding="ISO-8859-1")
pymoli_file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [37]:
#identify incomplete rows - classdemo (day 2 - cleaning data)
#there are no incomplete rows (no cleaning!)
pymoli_file_df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [39]:
#data types look correct - classdemo (day 2 - cleaning data)
pymoli_file_df.dtypes

Purchase ID      int64
SN              object
Age              int64
Gender          object
Item ID          int64
Item Name       object
Price          float64
dtype: object

In [18]:
pymoli_file_df.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   91.755128    3.050987
std     225.310896    6.659444   52.697702    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   47.750000    1.980000
50%     389.500000   22.000000   92.000000    3.150000
75%     584.250000   25.000000  138.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [36]:
#value counts - classdemo (day 1 - training grounds)
#this shows that a lot of SN shows up multiple times. Can't just count index, need to count unique SNs
pymoli_file_df["SN"].value_counts().head()

Lisosia93      5
Idastidru52    4
Iral74         4
Aelin32        3
Iskadarya95    3
Name: SN, dtype: int64

In [47]:
#count unique screen names. pull unique screen names and find the length. 
#https://www.geeksforgeeks.org/how-to-count-distinct-values-of-a-pandas-dataframe-column/ (about halfway down on site)
sn_count = len(pymoli_file_df["SN"].unique())
print("Total Number of Players: " + str(sn_count))

Total Number of Players: 576

In [105]:
#create a data frame from above calculation (create dictionary to dataframe)
#classdemo (day 2? - creating data frames)
player_count_dict = [{"Total Players": sn_count}]
player_count_df = pd.DataFrame(player_count_dict)
player_count_df

   Total Players
0            576

In [71]:
#count unique items. pull unique items and find the lenght. 
#https://www.geeksforgeeks.org/how-to-count-distinct-values-of-a-pandas-dataframe-column/ (about halfway down on site)
number_unique_items = len(pymoli_file_df["Item Name"].unique())
print("Number of Unique Items: " + str(number_unique_items))

#count and sum
num_purchases = pymoli_file_df["Price"].count()
sum_purchases = pymoli_file_df["Price"].sum()

#sum the purchase price divided by # of purchases
avg_purchase_price = round(pymoli_file_df["Price"].sum()/pymoli_file_df["Price"].count())
print("Average Purchase Price: $" + str(avg_purchase_price))

#total number of purchases and total revenue
print("Total Number of Purchases: " + str(num_purchases))
print("Total Revenue: $" + str(sum_purchases))

Number of Unique Items: 179
Average Purchase Price: $3.0
Total Number of Purchases: 780
Total Revenue: $2379.77

In [77]:
#create a data frame from above calculations (create dictionary to dataframe)
#classdemo (day 2? - creating data frames)
purchasing_dict = [{"Number of Unique Items": number_unique_items, "Average Purchase Price": avg_purchase_price,
                    "Total Number of Purchases": num_purchases,"Total Revenue": sum_purchases}]
purchase_analysis_df = pd.DataFrame(purchasing_dict)
purchase_analysis_df

,Number of Unique Items,Average Purchase Price,Total Number of Purchases,Total Revenue
0,179,3.0,780,2379.77

In [81]:
#this shows only three genders were listed (no need to merge any)
pymoli_file_df["Gender"].unique()

array(['Male', 'Other / Non-Disclosed', 'Female'], dtype=object)

In [85]:
#not what i want to do for this
#this counts duplicate screen names
gender_counts = pymoli_file_df["Gender"].value_counts()
gender_counts_df = pd.DataFrame(gender_counts)
gender_counts_df

                       Gender
Male                      652
Female                    113
Other / Non-Disclosed      15

In [109]:
#create data frame with just screen name and gender
#classdemo (day 2 - good movies)
#need to get rid of duplicates
gender_df = pymoli_file_df[["SN", "Gender", "Item Name", "Price", "Age"]]
gender_df

,SN,Gender,Item Name,Price,Age
0,Lisim78,Male,"Extraction, Quickblade Of Trembling Hands",3.53,20
1,Lisovynya38,Male,Frenzied Scimitar,1.56,40
2,Ithergue48,Male,Final Critic,4.88,24
3,Chamassasya86,Male,Blindscythe,3.27,24
4,Iskosia90,Male,Fury,1.44,23
...,...,...,...,...,...
775,Aethedru70,Female,Wolf,3.54,21
776,Iral74,Male,Exiled Doomblade,1.63,21
777,Yathecal72,Male,"Celeste, Incarnation of the Corrupted",3.46,20
778,Sisur91,Male,Final Critic,4.19,7
779,Ennrian78,Male,Dawn,4.60,24

In [93]:
#remove duplicate rows of data
#https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.drop_duplicates.html
sn_gender_df = gender_df.drop_duplicates()
sn_gender_df

                SN  Gender
0          Lisim78    Male
1      Lisovynya38    Male
2       Ithergue48    Male
3    Chamassasya86    Male
4        Iskosia90    Male
..             ...     ...
773         Hala31    Male
774     Jiskjask80    Male
775     Aethedru70  Female
777     Yathecal72    Male
778        Sisur91    Male

[576 rows x 2 columns]

In [96]:
#gender counts (series)
#class demo (day 2 - UFO sightings)
sn_gender_series = sn_gender_df["Gender"].value_counts()
sn_gender_series

Male                     484
Female                    81
Other / Non-Disclosed     11
Name: Gender, dtype: int64

In [99]:
#group by gender
#class demo (day 2 - UFO sightings)
grouped_gender_df = sn_gender_df.groupby(["Gender"])
grouped_gender_df
grouped_gender_df.count().head(10)

                        SN
Gender
Female                  81
Male                   484
Other / Non-Disclosed   11

In [102]:
#group by gender
#class demo (day 2 - UFO sightings)
gender_demographics_df = pd.DataFrame({"Total Count": sn_gender_series, 
                                       "Percentage of Players": sn_gender_series/sn_count})
gender_demographics_df

                       Total Count  Percentage of Players
Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097

In [ ]:
purchase_count = 
avg_price = 
total_value =
avg_purchase_total_per_person_by_gender = 
group by gender

In [ ]:
#group by gender
#class demo (day 2 - UFO sightings)
grouped_gender_df = sn_gender_df.groupby(["Gender"])
grouped_gender_df
grouped_gender_df.count().head(10)

In [ ]:
#group by gender and purchase info
#class demo (day 2 - UFO sightings)
grouped_gender_df = sn_gender_df.groupby([["Gender", "Purchase Count", ""])
grouped_gender_df
grouped_gender_df.count().head(10)